
# See 正規表現でのメールアドレスチェックは見直すべき – ReDoS
#     https://blog.ohgaki.net/redos-must-review-mail-address-validation
#  -> 例が適切ではない。書き誤った正規表現をあげつらってどうする?

# これは脆弱. `@` の前の `.` が何にでもマッチしてしまう。単に書き誤り.
#re = /\A([\w+\-].?)+@[a-z\d\-]+(\.[a-z]+)*\.[a-z]+\z/i

# 定義から導出 -> 特に爆発しない (ように書いている).
#re = /^(?-mix:((?:[A-Za-z0-9!#$%&'*+\-\/=?^_`{|}~]{1,64}(?:\.[A-Za-z0-9!#$%&'*+\-\/=?^_`{|}~]{1,62}){0,31}|"(?:[\x21\x23-\x5B\x5D-\x7E]|\\[\x20-~]){0,62}"))@((?:(?:[A-Za-z0-9](?:[A-Za-z0-9-]{0,61}[A-Za-z0-9])?\.){0,127}[A-Za-z](?:[A-Za-z0-9-]{0,61}[A-Za-z0-9])?)|(?:\[(?:(?:[0-9]{1,3}(?:\.[0-9]{1,3}){3})|(?:(?:[0-9A-Fa-f]{1,4})?(?:(?:::|:)(?:[0-9A-Fa-f]{1,4})){1,7}(?:(?:::|:)(?:[0-9]{1,3}(?:\.[0-9]{1,3}){3}))?))\])))$/

# これなら? -> まだ爆発するが、100Kバイトぐらい伸ばさないといけない.
re = /\A([\w+\-]\.?)+@[a-z\d\-]+(\.[a-z]+)*\.[a-z]+\z/i

(5..12).each do |n|
  s = "username@host" + ".abcde" * n + "." # 末尾でマッチしない.
  start = Time.now()
  p re =~ s
  p s.length.to_s + ': ' + (Time.now() - start).to_s
end
